standalone/app/controllers/courses_controller.rb

	def create
	    @trip = Trip.find(params[:trip_id])
	    @course = @trip.courses.create(course_params)
---
SELECT  "trips".* FROM "trips" WHERE "trips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "courses" ("order", "comment", "trip_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["order", 0.1e1], ["comment", "course 1"], ["trip_id", 1], ["created_at", 2017-02-05 15:04:40 UTC], ["updated_at", 2017-02-05 15:04:40 UTC]]

	def destroy
	    @trip = Trip.find(params[:trip_id])
	    @course = @trip.courses.find(params[:id])
	    @course.destroy
---
SELECT  "trips".* FROM "trips" WHERE "trips"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT  "courses".* FROM "courses" WHERE "courses"."trip_id" = $1 AND "courses"."id" = $2 LIMIT $3  [["trip_id", 4], ["id", 3], ["LIMIT", 1]]
DELETE FROM "courses" WHERE "courses"."id" = $1  [["id", 3]]