app/controllers/trips_controller.rb

SELECT  "trips".* FROM "trips" WHERE "trips"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
	def edit
	    @trip = Trip.find(params[:id])

INSERT INTO "trips" ("title", "address", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "GeoPosition"], ["address", "London, UK"], ["created_at", 2017-02-05 09:38:38 UTC], ["updated_at", 2017-02-05 09:38:38 UTC]]
---
	def create
	  @trip = Trip.new(params.require(:trip).permit(:title, :address))

	  if @trip.save

SELECT  "trips".* FROM "trips" WHERE "trips"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "trips" WHERE "trips"."id" = $1  [["id", 2]]
---
	def destroy
	  @trip = Trip.find(params[:id])
	  @trip.destroy